Repository: ShekharPatil9120/endee-rag-semantic-search
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hi, kn, ta

source: Dashboard
hi: डैशबोर्ड
kn: ಡ್ಯಾಶ್‌ಬೋರ್ಡ್
ta: டாஷ்போர்டு

source: Smart Farming
hi: स्मार्ट फार्मिंग
kn: ಸ್ಮಾರ್ಟ್ ಫಾರ್ಮಿಂಗ್
ta: ஸ்மார்ட் விவசாயம்

source: Home
hi: होम
kn: ಮುಖಪುಟ
ta: முகப்பு

source: Profile
hi: प्रोफ़ाइल
kn: ಪ್ರೊಫೈಲ್
ta: சுயவிவரம்

source: Logout
hi: लॉगआउट
kn: ಲಾಗ್ ಔಟ್
ta: வெளியேறு

source: Language
hi: भाषा
kn: ಭಾಷೆ
ta: மொழி

source: Smart Farming Dashboard
hi: स्मार्ट फार्मिंग डैशबोर्ड
kn: ಸ್ಮಾರ್ಟ್ ಫಾರ್ಮಿಂಗ್ ಡ್ಯಾಶ್‌ಬೋರ್ಡ್
ta: ஸ்மார்ட் விவசாய டாஷ்போர்டு

source: Welcome, <strong>%(user.username)s</strong> 👋
hi: स्वागत है, <strong>%(user.username)s</strong> 👋
kn: ಸ್ವಾಗತ, <strong>%(user.username)s</strong> 👋
ta: வரவேற்பு, <strong>%(user.username)s</strong> 👋

source: Manage and monitor your farm efficiently with real-time insights.
hi: रीयल-टाइम जानकारी के साथ अपने खेत का कुशलतापूर्वक प्रबंधन और निगरानी करें।
kn: ರಿಯಲ್-ಟೈಮ್ ಮಾಹಿತಿಯೊಂದಿಗೆ ನಿಮ್ಮ ಫಾರ್ಮ್‌ನನ್ನು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ನಿರ್ವಹಿಸಿ ಮತ್ತು ಮೇಲ್ವಿಚಾರಣೆ ಮಾಡಿ.
ta: உங்கள் பண்ணையை நேரடி தகவல்களுடன் திறம்பட நிர்வகித்து கண்காணிக்கவும்.

source: Crops
hi: फसलें
kn: ಬೆಳೆಗಳು
ta: பயிர்கள்

source: Active
hi: सक्रिय
kn: ಸಕ್ರಿಯ
ta: செயலில்

source: Moisture
hi: नमी
kn: ತೇವಾಂಶ
ta: ஈரப்பதம்

source: Avg
hi: औसत
kn: ಸರಾಸರಿ
ta: சராசரி

source: Motors
hi: मोटर
kn: ಮೋಟಾರ್‌ಗಳು
ta: மோட்டார்கள்

source: Online
hi: ऑनलाइन
kn: ಆನ್‌ಲೈನ್
ta: ஆன்லைன்

source: Cameras
hi: कैमरे
kn: ಕ್ಯಾಮೆರಾಗಳು
ta: கேமராக்கள்

source: Connected
hi: कनेक्टेड
kn: ಕನೆಕ್ಟ್ ಆಗಿದೆ
ta: இணைக்கப்பட்டது

source: Crop Disease Detection
hi: फसल रोग पहचान
kn: ಬೆಳೆ ರೋಗ ಪತ್ತೆ
ta: பயிர் நோய் கண்டறிதல்

source: Analyze leaf images to detect plant diseases.
hi: पत्तियों की छवियों का विश्लेषण करके पौधों की बीमारियों का पता लगाएँ।
kn: ಸಸ್ಯರೋಗಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲು ಎಲೆಗಳ ಚಿತ್ರಗಳನ್ನು ವಿಶ್ಲೇಷಿಸಿ.
ta: தாவர நோய்களை கண்டறிய இலைப் படங்களை பகுப்பாய்வு செய்யவும்.

source: Crop Recommendation
hi: फसल सिफारिश
kn: ಬೆಳೆ ಶಿಫಾರಸು
ta: பயிர் பரிந்துரை

source: Get the best crop suggestions for your soil and weather.
hi: अपनी मिट्टी और मौसम के लिए सर्वोत्तम फसल सुझाव प्राप्त करें।
kn: ನಿಮ್ಮ ಮಣ್ಣು ಮತ್ತು ಹವಾಮಾನಕ್ಕೆ ಉತ್ತಮ ಬೆಳೆ ಶಿಫಾರಸುಗಳನ್ನು ಪಡೆಯಿರಿ.
ta: உங்கள் மண் மற்றும் காலநிலைக்கான சிறந்த பயிர் பரிந்துரைகளைப் பெறுங்கள்.

source: Motor Control
hi: मोटर नियंत्रण
kn: ಮೋಟಾರ್ ನಿಯಂತ್ರಣ
ta: மோட்டார் கட்டுப்பாடு

source: Manually or automatically control water flow.
hi: पानी के प्रवाह को मैन्युअल या स्वचालित रूप से नियंत्रित करें।
kn: ನೀರಿನ ಹರಿವನ್ನು ಕೈಯಿಂದ ಅಥವಾ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನಿಯಂತ್ರಿಸಿ.
ta: கையால் அல்லது தானியக்கமாக நீரின் ஓட்டத்தை கட்டுப்படுத்தவும்.

source: Camera Monitoring
hi: कैमरा मॉनिटरिंग
kn: ಕ್ಯಾಮೆರಾ ಮೇಲ್ವಿಚಾರಣೆ
ta: கேமரா கண்காணிப்பு

source: View and manage real-time camera images.
hi: रीयल-टाइम कैमरा छवियाँ देखें और प्रबंधित करें।
kn: ರಿಯಲ್-ಟೈಮ್ ಕ್ಯಾಮೆರಾ ಚಿತ್ರಗಳನ್ನು ವೀಕ್ಷಿಸಿ ಮತ್ತು ನಿರ್ವಹಿಸಿ.
ta: நேரடி கேமரா படங்களைப் பார்வையிட்டு நிர்வகிக்கவும்.

source: Welcome
hi: स्वागत है
kn: ಸ್ವಾಗತ
ta: வரவேற்பு

source: Here’s your real-time farm environment overview
hi: यह रहा आपका रीयल-टाइम खेत पर्यावरण अवलोकन
kn: ಇದಾಗಿದೆ ನಿಮ್ಮ ರಿಯಲ್-ಟೈಮ್ ಫಾರ್ಮ್ ಪರಿಸರ ಅವಲೋಕನ
ta: இது உங்கள் நேரடி பண்ணைச் சூழல் பார்வை

source: Temperature
hi: तापमान
kn: ತಾಪಮಾನ
ta: வெப்பநிலை

source: Humidity
hi: आर्द्रता
kn: ಆರ್ದ್ರತೆ
ta: ஈரப்பதம்

source: Soil Moisture
hi: मृदा नमी
kn: ಮಣ್ಣಿನ ತೇವಾಂಶ
ta: மண்ணின் ஈரப்பதம்

source: Air Quality
hi: वायु गुणवत्ता
kn: ಗಾಳಿಯ ಗುಣಮಟ್ಟ
ta: காற்றின் தரம்

source: Data updates automatically every 5 seconds (connected to live sensors).
hi: डेटा हर 5 सेकंड में स्वचालित रूप से अपडेट होता है (लाइव सेंसर से जुड़ा हुआ)।
kn: ಮಾಹಿತಿ ಪ್ರತಿ 5 ಸೆಕೆಂಡುಗಳಿಗೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನವೀಕರಿಸಲಾಗುತ್ತದೆ (ಲೈವ್ ಸೆನ್ಸರ್‌ಗಳಿಗೆ ಸಂಪರ್ಕಗೊಂಡಿದೆ).
ta: தரவு ஒவ்வொரு 5 விநாடிகளிலும் தானாக புதுப்பிக்கப்படும் (நேரடி சென்சார்களுடன் இணைக்கப்பட்டுள்ளது).

source: Smart Farming Solution Overview
hi: स्मार्ट फार्मिंग समाधान अवलोकन
kn: ಸ್ಮಾರ್ಟ್ ಫಾರ್ಮಿಂಗ್ ಪರಿಹಾರದ ಅವಲೋಕನ
ta: ஸ்மார்ட் விவசாய தீர்வின் சுருக்கம்

source: About the Project
hi: परियोजना के बारे में
kn: ಯೋಜನೆಯ ಬಗ್ಗೆ
ta: திட்டத்தைப் பற்றி

source: Our Smart Farming system integrates IoT and AI to monitor soil moisture, temperature, humidity, and air quality in real time. The system automates irrigation control and crop recommendation to ensure optimal growth and efficient water usage.
hi: हमारा स्मार्ट फार्मिंग सिस्टम वास्तविक समय में मृदा नमी, तापमान, आर्द्रता और वायु गुणवत्ता की निगरानी के लिए IoT और AI को एकीकृत करता है। यह प्रणाली सिंचाई नियंत्रण और फसल सिफारिश को स्वचालित करती है ताकि इष्टतम वृद्धि और कुशल जल उपयोग सुनिश्चित किया जा सके।
kn: ನಮ್ಮ ಸ್ಮಾರ್ಟ್ ಫಾರ್ಮಿಂಗ್ ಸಿಸ್ಟಮ್ IoT ಮತ್ತು AI ಅನ್ನು ನೈಜ-ಕಾಲದಲ್ಲಿ ಮಣ್ಣಿನ ತೇವಾಂಶ, ತಾಪಮಾನ, ಆರ್ದ್ರತೆ ಮತ್ತು ಗಾಳಿಯ ಗುಣಮಟ್ಟವನ್ನು ಮೇಲ್ವಿಚಾರಣೆ ಮಾಡಲು ಸಂಯೋಜಿಸುತ್ತದೆ. ಈ ವ್ಯವಸ್ಥೆ ನೀರಾವರಿ ನಿಯಂತ್ರಣ ಮತ್ತು ಬೆಳೆ ಶಿಫಾರಸುಗಳನ್ನು ಸ್ವಯಂಚಾಲಿತಗೊಳಿಸುತ್ತದೆ, ಇದು ಉತ್ತಮ ಬೆಳವಣಿಗೆ ಮತ್ತು ಪರಿಣಾಮಕಾರಿ ನೀರಿನ ಬಳಕೆಯನ್ನು ಖಚಿತಪಡಿಸುತ್ತದೆ.
ta: எங்கள் ஸ்மார்ட் விவசாய அமைப்பு, மண்ணின் ஈரப்பதம், வெப்பநிலை, ஈரப்பதம் மற்றும் காற்றின் தரத்தை நேரடியாக கண்காணிக்க IoT மற்றும் AI ஐ ஒருங்கிணைக்கிறது. இந்த அமைப்பு நீர்ப்பாசன கட்டுப்பாடு மற்றும் பயிர் பரிந்துரைகளை தானியக்கமாக செய்து சிறந்த வளர்ச்சியும் நீர் பயனுமையும் உறுதி செய்கிறது.

source: Architecture Overview
hi: वास्तुकला अवलोकन
kn: ವ್ಯಾಸವಿನ್ಯಾಸ ಅವಲೋಕನ
ta: மைப்புக் கண்ணோட்டம்

source: Data is collected from sensors connected to NodeMCU and transmitted to the Django Cloud Server via APIs. The Django app processes and displays this data in real time, while AI models recommend the best crop based on environmental parameters.
hi: डेटा NodeMCU से जुड़े सेंसरों से एकत्र किया जाता है और API के माध्यम से Django क्लाउड सर्वर पर भेजा जाता है। Django ऐप इस डेटा को वास्तविक समय में संसाधित और प्रदर्शित करता है, जबकि AI मॉडल पर्यावरणीय मापदंडों के आधार पर सर्वश्रेष्ठ फसल की सिफारिश करता है।
kn: NodeMCU ಗೆ ಸಂಪರ್ಕಗೊಂಡಿರುವ ಸೆನ್ಸರ್‌ಗಳಿಂದ ಡೇಟಾವನ್ನು ಸಂಗ್ರಹಿಸಿ API ಗಳ ಮೂಲಕ Django ಕ್ಲೌಡ್ ಸರ್ವರ್‌ಗೆ ಪ್ರಸಾರ ಮಾಡಲಾಗುತ್ತದೆ. Django ಅಪ್ಲಿಕೇಶನ್ ಈ ಡೇಟಾವನ್ನು ನೈಜ-ಕಾಲದಲ್ಲಿ ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಿ ಪ್ರದರ್ಶಿಸುತ್ತದೆ, ಅಲ್ಲಿ AI ಮಾದರಿಗಳು ಪರಿಸರ ಪ್ಯಾರಾಮೀಟರ್‌ಗಳ ಆಧಾರದ ಮೇಲೆ ಅತ್ಯುತ್ತಮ ಬೆಳೆ ಶಿಫಾರಸು ಮಾಡುತ್ತವೆ.
ta: NodeMCU-க்கு இணைக்கப்பட்ட சென்சார்களிலிருந்து தரவு சேகரிக்கப்பட்டு API களின் மூலம் Django கிளவுட் சர்வருக்கு அனுப்பப்படுகிறது. Django பயன்பாடு இந்த தரவை நேரடியாக செயலாக்கி காட்சிப்படுத்துகிறது, அதே சமயம் AI மாதிரிகள் சுற்றுச்சூழல் அளவுருக்களின் அடிப்படையில் சிறந்த பயிரை பரிந்துரைக்கின்றன.

source: Key Features
hi: मुख्य विशेषताएँ
kn: ಮುಖ್ಯ ವೈಶಿಷ್ಟ್ಯಗಳು
ta: முக்கிய அம்சங்கள்

source: Real-time monitoring of temperature, humidity, and soil moisture
hi: तापमान, आर्द्रता और मृदा नमी की रीयल-टाइम निगरानी
kn: ತಾಪಮಾನ, ಆರ್ದ್ರತೆ ಮತ್ತು ಮಣ್ಣಿನ ತೇವಾಂಶದ ನೈಜ-ಕಾಲದ ಮೇಲ್ವಿಚಾರಣೆ
ta: வெப்பநிலை, ஈரப்பதம் மற்றும் மண்ணின் ஈரப்பதத்தை நேரடியாக கண்காணித்தல்

source: AI-based crop recommendation
hi: AI आधारित फसल सिफारिश
kn: AI ಆಧಾರಿತ ಬೆಳೆ ಶಿಫಾರಸು
ta: AI அடிப்படையிலான பயிர் பரிந்துரை

source: Automated irrigation based on soil condition
hi: मिट्टी की स्थिति के आधार पर स्वचालित सिंचाई
kn: ಮಣ್ಣಿನ ಸ್ಥಿತಿಯ ಆಧಾರದ ಮೇಲೆ ಸ್ವಯಂಚಾಲಿತ ನೀರಾವರಿ
ta: மண்ணின் நிலைக்கு ஏற்ப தானியக்க நீர்ப்பாசனம்

source: Data visualization and analytics dashboard
hi: डेटा विज़ुअलाइज़ेशन और विश्लेषण डैशबोर्ड
kn: ಡೇಟಾ ದೃಶ್ಯೀಕರಣ ಮತ್ತು ವಿಶ್ಲೇಷಣಾ ಡ್ಯಾಶ್‌ಬೋರ್ಡ್
ta: தரவு காட்சிப்படுத்தல் மற்றும் பகுப்பாய்வு டாஷ்போர்டு

source: Cloud-based data storage and control
hi: क्लाउड-आधारित डेटा संग्रहण और नियंत्रण
kn: ಕ್ಲೌಡ್ ಆಧಾರಿತ ಡೇಟಾ ಸಂಗ್ರಹಣೆ ಮತ್ತು ನಿಯಂತ್ರಣ
ta: கிளவுட் அடிப்படையிலான தரவு சேமிப்பு மற்றும் கட்டுப்பாடு

source: AI & Prediction System
hi: AI और पूर्वानुमान प्रणाली
kn: AI ಮತ್ತು ಭವಿಷ್ಯವಾಣಿ ವ್ಯವಸ್ಥೆ
ta: AI மற்றும் கணிப்புக் கணினி அமைப்பு

source: Our integrated AI engine analyzes soil and weather parameters to predict the best crop for current conditions. It also provides nutrient balance and irrigation guidance, helping farmers make data-driven decisions.
hi: हमारा एकीकृत AI इंजन मिट्टी और मौसम के मापदंडों का विश्लेषण करता है ताकि मौजूदा परिस्थितियों के लिए सर्वोत्तम फसल का अनुमान लगाया जा सके। यह पोषक तत्व संतुलन और सिंचाई मार्गदर्शन भी प्रदान करता है, जिससे किसानों को डेटा-आधारित निर्णय लेने में सहायता मिलती है।
kn: ನಮ್ಮ ಏಕೀಕೃತ AI ಎಂಜಿನ್ ಪ್ರಸ್ತುತ ಪರಿಸ್ಥಿತಿಗಳಿಗೆ ಅತ್ಯುತ್ತಮ ಬೆಳೆಗಳನ್ನು ಊಹಿಸಲು ಮಣ್ಣು ಮತ್ತು ಹವಾಮಾನ ಪ್ಯಾರಾಮೀಟರ್‌ಗಳನ್ನು ವಿಶ್ಲೇಷಿಸುತ್ತದೆ. ಇದು ಪೋಷಕಾಂಶ ಸಮತೋಲನ ಮತ್ತು ನೀರಾವರಿ ಮಾರ್ಗದರ್ಶನವನ್ನು ಒದಗಿಸುತ್ತದೆ, ರೈತರಿಗೆ ಡೇಟಾ ಆಧಾರಿತ ನಿರ್ಧಾರಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ.
ta: எங்கள் ஒருங்கிணைந்த AI இயந்திரம் மண் மற்றும் வானிலை அளவுருக்களை பகுப்பாய்வு செய்து தற்போதைய நிலைகளுக்கான சிறந்த பயிரை கணிக்கிறது. இது சத்துச் சமநிலை மற்றும் நீர்ப்பாசன வழிகாட்டுதலையும் வழங்குகிறது, இது விவசாயிகள் தரவு சார்ந்த முடிவுகளை எடுக்க உதவுகிறது.

source: Future Scope
hi: भविष्य की संभावनाएँ
kn: ಭವಿಷ್ಯದ ವ್ಯಾಪ್ತಿ
ta: எதிர்கால நோக்கம்

source: We plan to integrate image-based crop disease detection using CNN models and deploy mobile notifications for irrigation alerts, aiming to deliver a complete precision agriculture platform.
hi: हम CNN मॉडलों का उपयोग करके छवि-आधारित फसल रोग पहचान को एकीकृत करने और सिंचाई अलर्ट के लिए मोबाइल सूचनाएँ तैनात करने की योजना बना रहे हैं, ताकि एक पूर्ण सटीक कृषि प्लेटफ़ॉर्म प्रदान किया जा सके।
kn: ನಾವು CNN ಮಾದರಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಚಿತ್ರ ಆಧಾರಿತ ಬೆಳೆ ರೋಗ ಪತ್ತೆ ಮತ್ತು ನೀರಾವರಿ ಎಚ್ಚರಿಕೆಗಳಿಗಾಗಿ ಮೊಬೈಲ್ ಅಧಿಸೂಚನೆಗಳನ್ನು ಏಕೀಕರಿಸಲು ಯೋಜಿಸುತ್ತಿದ್ದೇವೆ, ಪೂರ್ಣ ಪ್ರಮಾಣದ ನಿಖರ ಕೃಷಿ ವೇದಿಕೆಯನ್ನು ಒದಗಿಸುವ ಉದ್ದೇಶದಿಂದ.
ta: நாங்கள் CNN மாதிரிகளைப் பயன்படுத்தி பட அடிப்படையிலான பயிர் நோய் கண்டறிதலை ஒருங்கிணைத்து, நீர்ப்பாசன எச்சரிக்கைகளுக்கான மொபைல் அறிவிப்புகளைப் பிரயோகிக்கத் திட்டமிட்டுள்ளோம், இது முழுமையான துல்லியமான விவசாய தளத்தை வழங்கும் நோக்கத்தைக் கொண்டது.
